# PySpark Fundamentals.

In [1]:
# Importing PySpark. 
import pyspark

In [2]:
# Reading Test 1 Sample. 
import pandas as pd
pd.read_csv('test1.csv')

        Name  age  Experience  Salary
0      Krish   31          10   30000
1  Sudhanshu   30           8   25000
2      Sunny   29           4   20000
3       Paul   24           3   20000
4     Harsha   21           1   15000
5    Shubham   23           2   18000

In [3]:
# Importing the Spark Session. 
from pyspark.sql import SparkSession

In [4]:
# Initialising Session. 
spark = SparkSession.builder.appName('Practice').getOrCreate()

In [5]:
# General Info About the Session. 
spark

In [6]:
# Defining the Spark Dataset. 
df_spark = spark.read.csv('test1.csv')

In [7]:
# General Shape for the Spark Dataset.
df_spark

DataFrame[_c0: string, _c1: string, _c2: string, _c3: string]

In [8]:
df_spark.show()

+---------+---+----------+------+
|      _c0|_c1|       _c2|   _c3|
+---------+---+----------+------+
|     Name|age|Experience|Salary|
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [9]:
# Include the Header Row. 
df_pyspark = spark.read.option('header','true').csv('test1.csv')

In [10]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [11]:
df_pyspark.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+